#include<stdio.h>
void yesterday(int *y, int *m, int *d)
{
	if(*y%4==0&&*y%100!=0||*y%400==0)//闰年
	{
		if (*m == 3 && *d == 1)//闰年的3.1——2.29
		{
			*m = 2;
			*d = 29;
		}
		else if (*m == 1 && *d == 1)//闰年的1.1——12.31
		{
			*y = *y - 1;
			*m = 12;
			*d = 31;
		}
		else if (*d==1)//闰年的大月.1
		{
			if(*m==2||*m==4||*m==6||*m==8||*m==9||*m==11)//闰年的大月.1
			{
				*m=*m-1;
				*d=31;
			}
			
			else if(*m==5||*m==7||*m==10||*m==12)//闰年的小月.1
			{
				*m=*m-1;
				*d=30;
			}
		}
		else if(*d!=1)
		{
			*m=*m-1;
			*d=*d-1;
		}
	}

	else 
	{
		if (*m == 1 && *d == 1)//平年的1.1
		{
			*y = *y - 1;
			*m = 12;
			*d = 31;
		}
	
		else if (*m == 3 && *d == 1)//平年的3.1——2.28
		{
			*m = 2;
			*d = 28;
		}
		else if (*d==1)//闰年的大月.1
		{
			if(*m==2||*m==4||*m==6||*m==8||*m==9||*m==11)//闰年的大月.1
			{
				*m=*m-1;
				*d=31;
			}
			
			else if(*m==5||*m==7||*m==10||*m==12)//闰年的小月.1
			{
				*m=*m-1;
				*d=30;
			}
		}
		else if(*d!=1)
		{
			*m=*m-1;
			*d=*d-1;
		}
	}
}

void main()
{
	int a,b,c,*x,*y,*z;
	scanf("%d%d%d",&a,&b,&c);
	yesterday(*x,*y,*z);
	printf("%d %d %d",*x,*y,*z);
}


